nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw72/driver_examples/lpadc/polling/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW727CxxxA
package_id: MCXW727CMFTA
mcu_data: ksdk2_0
processor_version: 0.2506.40
external_user_signals: {}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: ADC0, signal: 'A, 6', pin_signal: ADC0_A6/PTD2/LPTMR0_ALT3/TAMPER0/RF_GPO_5/TPM2_CH0, pull_select: down, pull_enable: disable, pull_value: low,
    passive_filter: disable, open_drain: disable}
  - {pin_num: '39', peripheral: LPUART1, signal: RX, pin_signal: PTC2/WUU0_P9/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM1_CH2/I3C0_PUR/FLEXIO0_D18, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '40', peripheral: LPUART1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM1_CH3/FLEXIO0_D19, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t portc2_pin39_config = {/* Internal pull-up/down resistor is disabled */
                                                   .pullSelect = (uint16_t)kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                   .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                                   /* Pin is configured as LPUART1_RX */
                                                   .mux = (uint16_t)kPORT_MuxAlt3,
                                                   /* Digital input is not inverted */
                                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(PORTC, 2U, &portc2_pin39_config);

    const port_pin_config_t portc3_pin40_config = {/* Internal pull-up/down resistor is disabled */
                                                   .pullSelect = (uint16_t)kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                   .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                                   /* Pin is configured as LPUART1_TX */
                                                   .mux = (uint16_t)kPORT_MuxAlt3,
                                                   /* Digital input is not inverted */
                                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(PORTC, 3U, &portc3_pin40_config);

    const port_pin_config_t portd2_pin25_config = {/* Internal pull-up/down resistor is disabled */
                                                   .pullSelect = (uint16_t)kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                   .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                                   /* Pin is configured as ADC0_A6 */
                                                   .mux = (uint16_t)kPORT_PinDisabledOrAnalog,
                                                   /* Digital input is not inverted */
                                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTD2 (pin 25) is configured as ADC0_A6 */
    PORT_SetPinConfig(PORTD, 2U, &portd2_pin25_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
